document.addEventListener('DOMContentLoaded', function() {
    document.getElementById('houseForm').addEventListener('submit', function(event) {
        event.preventDefault(); // Prevent default form submission


        const MetroStationsObject = {
            'Новокосино': [55.745113, 37.864052, 'ВАО'],
 'Новогиреево': [55.744444, 37.818333, 'ВАО'],
 'Перово': [55.735556, 37.765, 'ВАО'],
 'Шоссе Энтузиастов': [55.758633, 37.748477, 'ВАО'],
 'Авиамоторная': [55.750278, 37.721944, 'ЮВАО'],
 'Площадь Ильича': [55.747115, 37.680726, 'ЮВАО'],
 'Марксистская': [55.740746, 37.65604, 'ЦАО'],
 'Третьяковская': [55.74073, 37.625624, 'ЦАО'],
 'Ховрино': [55.879444, 37.486667, 'САО'],
 'Беломорская': [55.8651, 37.4764, 'САО'],
 'Речной вокзал': [55.854152, 37.476728, 'САО'],
 'Водный стадион': [55.838978, 37.487515, 'САО'],
 'Войковская': [55.818923, 37.497791, 'САО'],
 'Сокол': [55.805564, 37.515245, 'САО'],
 'Аэропорт': [55.800441, 37.530477, 'САО'],
 'Динамо': [55.789704, 37.558212, 'САО'],
 'Белорусская': [55.776389, 37.580278, 'САО'],
 'Маяковская': [55.769808, 37.596192, 'ЦАО'],
 'Тверская': [55.765343, 37.603918, 'ЦАО'],
 'Театральная': [55.758808, 37.61768, 'ЦАО'],
 'Новокузнецкая': [55.742391, 37.62928, 'ЦАО'],
 'Павелецкая': [55.731414, 37.636294, 'ЦАО'],
 'Автозаводская': [55.70631, 37.66314, 'ЮАО'],
 'Технопарк': [55.695, 37.664167, 'ЮАО'],
 'Коломенская': [55.677423, 37.663719, 'ЮАО'],
 'Каширская': [55.655, 37.648611, 'ЮАО'],
 'Кантемировская': [55.636107, 37.656218, 'ЮАО'],
 'Царицыно': [55.618309, 37.668846, 'ЮАО'],
 'Орехово': [55.61269, 37.695214, 'ЮАО'],
 'Домодедовская': [55.610131, 37.717111, 'ЮАО'],
 'Красногвардейская': [55.614075, 37.742697, 'ЮАО'],
 'Алма-Атинская': [55.63349, 37.765678, 'ЮАО'],
 'Медведково': [55.888103, 37.661562, 'СВАО'],
 'Бабушкинская': [55.870641, 37.664341, 'СВАО'],
 'Свиблово': [55.855558, 37.653379, 'СВАО'],
 'Ботанический сад': [55.845556, 37.640278, 'СВАО'],
 'ВДНХ': [55.819626, 37.640751, 'СВАО'],
 'Алексеевская': [55.807794, 37.638699, 'СВАО'],
 'Рижская': [55.793889, 37.638611, 'СВАО'],
 'Проспект Мира': [55.779584, 37.633646, 'ЦАО'],
 'Сухаревская': [55.772315, 37.63285, 'ЦАО'],
 'Тургеневская': [55.765371, 37.636732, 'ЦАО'],
 'Китай-город': [55.75436, 37.633877, 'ЦАО'],
 'Октябрьская': [55.729264, 37.611049, 'ЦАО'],
 'Шаболовская': [55.718828, 37.607892, 'ЮАО'],
 'Ленинский проспект': [55.70678, 37.58499, 'ЮЗАО'],
 'Академическая': [55.687147, 37.5723, 'ЮЗАО'],
 'Профсоюзная': [55.677671, 37.562595, 'ЮЗАО'],
 'Новые Черемушки': [55.670077, 37.554493, 'ЮЗАО'],
 'Калужская': [55.656682, 37.540075, 'ЮЗАО'],
 'Беляево': [55.642357, 37.526115, 'ЮЗАО'],
 'Коньково': [55.631857, 37.519156, 'ЮЗАО'],
 'Теплый Стан': [55.61873, 37.505912, 'НАО (Новомосковский)'],
 'Ясенево': [55.606182, 37.5334, 'ЮЗАО'],
 'Новоясеневская': [55.601947, 37.553017, 'ЮЗАО'],
 'Бульвар Рокоссовского': [55.817222, 37.736944, 'ВАО'],
 'Черкизовская': [55.802787, 37.744863, 'ВАО'],
 'Преображенская площадь': [55.796322, 37.713582, 'ВАО'],
 'Сокольники': [55.791111, 37.678889, 'ВАО'],
 'Красносельская': [55.780014, 37.666097, 'ЦАО'],
 'Комсомольская': [55.775672, 37.654772, 'ЦАО'],
 'Красные ворота': [55.768307, 37.6478, 'ЦАО'],
 'Чистые пруды': [55.76499, 37.638293, 'ЦАО'],
 'Лубянка': [55.759889, 37.625336, 'ЦАО'],
 'Охотный ряд': [55.757228, 37.615078, 'ЦАО'],
 'Библиотека им.Ленина': [55.752123, 37.610388, 'ЦАО'],
 'Кропоткинская': [55.745297, 37.604217, 'ЦАО'],
 'Парк культуры': [55.735221, 37.593095, 'ЦАО'],
 'Фрунзенская': [55.727462, 37.58022, 'ЦАО'],
 'Спортивная': [55.722388, 37.562041, 'ЦАО'],
 'Воробьевы горы': [55.709169, 37.557293, 'ЗАО'],
 'Университет': [55.69329, 37.534511, 'ЮЗАО'],
 'Проспект Вернадского': [55.677778, 37.505, 'ЗАО'],
 'Юго-Западная': [55.663146, 37.482852, 'ЗАО'],
 'Тропарево': [55.6459, 37.4725, 'ЮЗАО'],
 'Румянцево': [55.633, 37.4419, 'НАО (Новомосковский)'],
 'Саларьево': [55.6227, 37.424, 'НАО (Новомосковский)'],
 'Филатов луг': [55.5997, 37.4075, 'НАО (Новомосковский)'],
 'Прокшино': [55.5813, 37.4425, 'НАО (Новомосковский)'],
 'Ольховая': [55.5692, 37.4589, 'НАО (Новомосковский)'],
 'Коммунарка': [55.559765, 37.468716, 'НАО (Новомосковский)'],
 'Щелковская': [55.809962, 37.798261, 'ВАО'],
 'Первомайская': [55.794376, 37.799364, 'ВАО'],
 'Измайловская': [55.787713, 37.779896, 'ВАО'],
 'Партизанская': [55.788401, 37.74882, 'ВАО'],
 'Семеновская': [55.783096, 37.719289, 'ВАО'],
 'Электрозаводская': [55.781111, 37.705278, 'ЦАО'],
 'Бауманская': [55.772405, 37.67904, 'ЦАО'],
 'Курская': [55.740833, 37.660556, 'ЦАО'],
 'Площадь Революции': [55.756741, 37.62236, 'ЦАО'],
 'Арбатская': [55.752122, 37.601553, 'ЦАО'],
 'Смоленская': [55.749083, 37.582173, 'ЦАО'],
 'Киевская': [55.74361, 37.56735, 'ЗАО'],
 'Парк Победы': [55.736478, 37.514401, 'ЗАО'],
 'Славянский бульвар': [55.729722, 37.470556, 'ЗАО'],
 'Кунцевская': [55.730554, 37.445591, 'ЗАО'],
 'Молодежная': [55.741375, 37.415627, 'ЗАО'],
 'Крылатское': [55.756842, 37.408139, 'ЗАО'],
 'Строгино': [55.803831, 37.402405, 'СЗАО'],
 'Мякинино': [55.823342, 37.385214, 'СЗАО'],
 'Волоколамская': [55.835154, 37.382453, 'СЗАО'],
 'Митино': [55.846098, 37.36122, 'СЗАО'],
 'Пятницкое шоссе': [55.853634, 37.353108, 'СЗАО'],
 'Пионерская': [55.736027, 37.466728, 'ЗАО'],
 'Филевский парк': [55.739665, 37.483902, 'ЗАО'],
 'Багратионовская': [55.743544, 37.497042, 'ЗАО'],
 'Фили': [55.744263, 37.514526, 'ЗАО'],
 'Кутузовская': [55.741944, 37.533056, 'ЗАО'],
 'Студенческая': [55.738761, 37.54842, 'ЗАО'],
 'Александровский сад': [55.752255, 37.608775, 'ЦАО'],
 'Выставочная': [55.750243, 37.542641, 'ЦАО'],
 'Международная': [55.748324, 37.533282, 'ЦАО'],
 'Алтуфьево': [55.899034, 37.586473, 'СВАО'],
 'Бибирево': [55.883868, 37.603011, 'СВАО'],
 'Отрадное': [55.864273, 37.605066, 'СВАО'],
 'Владыкино': [55.847222, 37.591944, 'СВАО'],
 'Петровско-Разумовская': [55.839722, 37.568333, 'САО'],
 'Тимирязевская': [55.81866, 37.574498, 'САО'],
 'Дмитровская': [55.808056, 37.581734, 'САО'],
 'Савёловская': [55.794444, 37.590278, 'СВАО'],
 'Менделеевская': [55.781999, 37.599141, 'ЦАО'],
 'Цветной бульвар': [55.771653, 37.620466, 'ЦАО'],
 'Чеховская': [55.765747, 37.608493, 'ЦАО'],
 'Боровицкая': [55.750399, 37.60934, 'ЗАО'],
 'Полянка': [55.736795, 37.618594, 'ЦАО'],
 'Серпуховская': [55.726548, 37.624792, 'ЮАО'],
 'Тульская': [55.70961, 37.622569, 'ЮАО'],
 'Нагатинская': [55.682099, 37.620917, 'ЮАО'],
 'Нагорная': [55.672962, 37.610397, 'ЮАО'],
 'Нахимовский проспект': [55.662379, 37.605274, 'ЮЗАО'],
 'Севастопольская': [55.651451, 37.59809, 'ЮЗАО'],
 'Чертановская': [55.640538, 37.606065, 'ЮАО'],
 'Южная': [55.622436, 37.609047, 'ЮАО'],
 'Пражская': [55.610962, 37.602386, 'ЮАО'],
 'Улица Академика Янгеля': [55.596753, 37.601498, 'ЮАО'],
 'Аннино': [55.583477, 37.596999, 'ЮАО'],
 'Бульвар Дмитрия Донского': [55.568201, 37.576856, 'ЮЗАО'],
 'Планерная': [55.859676, 37.436808, 'СЗАО'],
 'Сходненская': [55.84926, 37.44076, 'СЗАО'],
 'Тушинская': [55.825479, 37.437024, 'СЗАО'],
 'Спартак': [55.8182, 37.4352, 'СЗАО'],
 'Щукинская': [55.8094, 37.463241, 'СЗАО'],
 'Октябрьское поле': [55.793581, 37.493317, 'СЗАО'],
 'Полежаевская': [55.777201, 37.517895, 'СЗАО'],
 'Беговая': [55.770833, 55.770833, 'САО'],
 'Улица 1905 года': [55.763944, 37.562271, 'ЦАО'],
 'Баррикадная': [55.760793, 37.581242, 'ЦАО'],
 'Пушкинская': [55.765607, 37.604356, 'ЦАО'],
 'Кузнецкий мост': [55.761498, 37.624423, 'ЦАО'],
 'Таганская': [55.742396, 37.653334, 'ЦАО'],
 'Пролетарская': [55.731546, 37.666917, 'ЦАО'],
 'Волгоградский проспект': [55.725546, 37.685197, 'ЮВАО'],
 'Текстильщики': [55.708934, 37.731283, 'ЮВАО'],
 'Кузьминки': [55.705493, 37.763295, 'ЮВАО'],
 'Рязанский проспект': [55.716139, 37.792694, 'ЮВАО'],
 'Выхино': [55.88, 37.816667, 'ВАО'],
 'Лермонтовский проспект': [55.702036, 37.851044, 'ЮВАО'],
 'Жулебино': [55.684722, 37.855833, 'ЮВАО'],
 'Котельники': [55.6743, 37.8582, 'ЮВАО'],
 'Новослободская': [55.779606, 37.601252, 'ЦАО'],
 'Добрынинская': [55.728994, 37.622533, 'ЦАО'],
 'Краснопресненская': [55.760378, 37.577114, 'ЦАО'],
 'Физтех': [55.921389, 37.546389, 'СВАО'],
 'Лианозово': [55.897316, 37.553261, 'САО'],
 'Яхромская': [55.8775, 37.545833, 'САО'],
 'Селигерская': [55.86483, 37.55005, 'САО'],
 'Верхние Лихоборы': [55.85566, 37.56282, 'САО'],
 'Окружная': [55.848889, 37.571111, 'СВАО'],
 'Фонвизинская': [55.822778, 37.588056, 'СВАО'],
 'Бутырская ': [55.813333, 37.602778, 'СВАО'],
 'Марьина Роща': [55.800833, 37.618889, 'СВАО'],
 'Достоевская': [55.781667, 37.613889, 'ЦАО'],
 'Трубная': [55.76771, 37.621926, 'ЦАО'],
 'Сретенский бульвар': [55.766106, 37.635688, 'ЦАО'],
 'Чкаловская': [55.755951, 37.659293, 'ЦАО'],
 'Римская': [55.747027, 37.679996, 'ЮВАО'],
 'Крестьянская застава': [55.732278, 37.665325, 'ЦАО'],
 'Дубровка': [55.71268, 37.677775, 'ЮВАО'],
 'Кожуховская': [55.706156, 37.68544, 'ЮВАО'],
 'Печатники': [55.694722, 37.7275, 'ЮВАО'],
 'Волжская': [55.690446, 37.754314, 'ЮВАО'],
 'Люблино': [55.676596, 37.761639, 'ЮВАО'],
 'Братиславская': [55.658817, 37.748415, 'ЮВАО'],
 'Марьино': [55.649158, 37.743844, 'ЮВАО'],
 'Борисово': [55.6325, 37.743333, 'ЮАО'],
 'Шипиловская': [55.621667, 37.743611, 'ЮАО'],
 'Зябликово': [55.611944, 37.745278, 'ЮАО'],
 'Варшавская': [55.653333, 37.619444, 'ЮАО'],
 'Каховская': [55.653056, 37.598333, 'ЮЗАО'],
 'Бунинская аллея': [55.537977, 37.515899, 'НАО (Новомосковский)'],
 'Улица Горчакова': [55.542281, 37.532063, 'НАО (Новомосковский)'],
 'Бульвар Адмирала Ушакова': [55.545207, 37.542329, 'НАО (Новомосковский)'],
 'Улица Скобелевская': [55.548103, 37.552721, 'НАО (Новомосковский)'],
 'Улица Старокачаловская': [55.569194, 37.576074, 'НАО (Новомосковский)'],
 'Лесопарковая': [55.581656, 37.577816, 'ЮАО'],
 'Битцевский Парк': [55.600066, 37.556058, 'ЮЗАО'],
 'Деловой центр': [55.7491, 37.5395, 'ЦАО'],
 'Пыхтино': [55.625, 37.298056, 'НАО (Новомосковский)'],
 'Минская': [55.723333, 37.533056, 'ЗАО'],
 'Ломоносовский проспект': [55.7055, 37.5225, 'ЗАО'],
 'Раменки': [55.6961, 37.505, 'ЗАО'],
 'Мичуринский проспект': [55.688333, 37.485, 'ЗАО'],
 'Озёрная': [55.6698, 37.4495],
 'Говорово': [55.6588, 37.4174, 'НАО (Новомосковский)'],
 'Солнцево': [55.649, 37.3911, 'ЗАО'],
 'Боровское шоссе': [55.647, 37.3701, 'ЗАО'],
 'Новопеределкино': [55.639167, 37.381111, 'ЗАО'],
 'Рассказовка': [55.6324, 37.3328, 'НАО (Новомосковский)'],
 'Ростокино': [55.839444, 37.667778, 'СВАО'],
 'Белокаменная': [55.83, 37.700556, 'ВАО'],
 'Локомотив': [55.803219, 37.745742, 'ВАО'],
 'Измайлово': [55.788611, 37.742778, 'ВАО'],
 'Соколиная Гора': [55.77, 37.745278, 'ВАО'],
 'Андроновка': [55.744444, 37.741111, 'ВАО'],
 'Нижегородская': [55.733333, 37.729444, 'ЮВАО'],
 'Новохохловская': [55.718523, 37.719236, 'ЮВАО'],
 'Угрешская': [55.718333, 37.697778, 'ЮВАО'],
 'ЗИЛ': [55.698333, 37.648333, 'ЮАО'],
 'Верхние Котлы': [55.69, 37.618889, 'ЮАО'],
 'Крымская': [55.690038, 37.605, 'ЮЗАО'],
 'Площадь Гагарина': [55.706944, 37.585833, 'ЮАО'],
 'Лужники': [55.720278, 37.563056, 'ЗАО'],
 'Шелепиха': [55.75723, 37.52571, 'СЗАО'],
 'Хорошево': [55.777222, 37.507222, 'СЗАО'],
 'Зорге': [55.787778, 37.504444, 'САО'],
 'Панфиловская': [55.799167, 37.498889, 'СЗАО'],
 'Стрешнево': [55.813611, 37.486944, 'СЗАО'],
 'Балтийская': [55.825833, 37.496111, 'САО'],
 'Коптево': [55.839637, 37.520037, 'САО'],
 'Лихоборы': [55.85, 37.5525, 'САО'],
 'Улица Милашенкова': [55.821876, 37.591206, 'СВАО'],
 'Телецентр': [55.821795, 37.608975, 'СВАО'],
 'Улица Академика Королёва': [55.821821, 37.627167, 'СВАО'],
 'Выставочный центр': [55.824086, 37.638494, 'ЦАО'],
 'Улица Сергея Эйзенштейна': [55.829305, 37.644997, 'СВАО'],
 'Новаторская': [55.670833, 37.52, 'ЮЗАО'],
 'Воронцовская': [55.658333, 37.540833, 'ЮЗАО'],
 'Зюзино': [55.655158, 37.575786, 'ЮЗАО'],
 'Кленовый бульвар': [55.674444, 37.680833, 'ЮАО'],
 'Нагатинский Затон': [55.684444, 37.703611, 'ЮАО'],
 'Лефортово': [55.764444, 37.702778, 'ЮВАО'],
 'Петровский парк': [55.79233, 37.55952, 'САО'],
 'ЦСКА': [55.78643, 37.53502, 'САО'],
 'Хорошевская': [55.77643, 37.51981, 'САО'],
 'Народное Ополчение': [55.775278, 39.484444, 'СЗАО'],
 'Мнёвники': [55.761153, 37.47139, 'СЗАО'],
 'Терехово': [55.748108, 37.459738, 'СЗАО'],
 'Давыдково': [55.715278, 37.451667, 'ЗАО'],
 'Аминьевская': [55.699444, 37.468056, 'ЗАО'],
 'Косино': [55.714167, 37.8475, 'ВАО'],
 'Улица Дмитриевского': [55.7093, 37.8792, 'ВАО'],
 'Лухмановская': [55.7078, 37.9004, 'ВАО'],
 'Некрасовка': [55.7029, 37.9264, 'ЮВАО'],
 'Юго-Восточная': [55.71, 37.82, 'ЮВАО'],
 'Окская': [55.72, 37.77, 'ЮВАО'],
 'Стахановская': [55.73, 37.76, 'ЮВАО'],
 'Лобня': [56.0048, 37.29057, 'ЗелАО'],
 'Шереметьевская': [55.983882, 37.498752, 'СВАО'],
 'Хлебниково': [55.970682, 37.504638, 'САО'],
 'Водники': [55.953419, 37.511143, 'САО'],
 'Долгопрудная': [55.938656, 37.520542, 'СВАО'],
 'Новодачная': [55.924459, 37.527877, 'СВАО'],
 'Марк': [55.904458, 37.538242, 'СВАО'],
 'Бескудниково': [55.882713, 37.567768, 'СВАО'],
 'Дегунино': [55.86586, 37.573235, 'САО'],
 'Тестовская': [55.750833, 37.530278, 'ЦАО'],
 'Рабочий Посёлок': [55.726957, 37.415577, 'ЗАО'],
 'Сетунь': [55.723713, 37.397259, 'ЗАО'],
 'Немчиновка': [55.715668, 37.374611, 'ЗАО'],
 'Сколково': [55.666801, 37.424618, 'ЗАО'],
 'Баковка': [55.682816, 37.315205, 'ЗАО'],
 'Одинцово': [55.67798, 37.27773, 'ЗАО'],
 'Нахабино': [55.841522, 37.185204, 'ЗелАО'],
 'Аникеевка': [55.832099, 37.219829, 'ЗАО'],
 'Опалиха': [55.82333, 37.246843, 'ЗАО'],
 'Красногорская': [55.814571, 37.303337, 'ЗАО'],
 'Павшино': [55.815231, 37.341461, 'ЗАО'],
 'Пенягино': [55.822539, 37.361049, 'СЗАО'],
 'Трикотажная': [55.833137, 37.398967, 'СЗАО'],
 'Покровское-Стрешнево': [55.814247, 37.47678, 'СЗАО'],
 'Красный Балтиец': [55.815514, 37.526367, 'САО'],
 'Гражданская': [55.805527, 37.55315, 'САО'],
 'Площадь трёх вокзалов': [55.776667, 37.651111, 'ЦАО'],
 'Москва Товарная': [55.745358, 37.688839, 'ЦАО'],
 'Калитники': [55.733981, 37.702203, 'ЮВАО'],
 'Депо': [55.674257, 37.728446, 'ЮВАО'],
 'Перерва': [55.660809, 37.716278, 'ЮВАО'],
 'Курьяново': [55.649722, 37.701667, 'ЮВАО'],
 'Москворечье': [55.641239, 37.689789, 'ЮАО'],
 'Покровское': [55.814247, 37.47678, 'ЮАО'],
 'Красный строитель': [55.589455, 37.615093, 'ЮАО'],
 'Битца': [55.571186, 37.611443, 'ЮАО'],
 'Бутово': [55.548279, 37.555668, 'ЮЗАО'],
 'Щербинка': [55.509724, 37.562008, 'НАО (Новомосковский)'],
 'Остафьево': [55.50337, 37.520055, 'НАО (Новомосковский)'],
 'Силикатная': [55.470278, 37.555278, 'НАО (Новомосковский)'],
 'Подольск': [55.431667, 37.565, 'ТАО (Троицкий)'],
 'Крюково': [55.979722, 37.173611, 'ЗелАО'],
 'Малино': [55.969167, 37.211667, 'ЗелАО'],
 'Фирсановская': [55.960278, 37.251111, 'ЗелАО'],
 'Сходня': [55.949722, 37.298611, 'СЗАО'],
 'Подрезково': [55.941667, 37.334722, 'САО'],
 'Новоподрезково': [55.936389, 37.351667, 'САО'],
 'Молжаниново': [55.924167, 37.380833, 'САО'],
 'Химки': [55.894444, 37.450833, 'СЗАО'],
 'Левобережная': [55.886944, 37.468611, 'САО'],
 'Грачёвская': [55.869444, 37.509167, 'САО'],
 'Моссельмаш': [55.862222, 37.526389, 'САО'],
 'Останкино': [55.817222, 37.603611, 'СВАО'],
 'Митьково': [55.786389, 37.6675, 'ВАО'],
 'Сортировочная': [55.763611, 37.720833, 'ВАО'],
 'Плющево': [55.730556, 37.774167, 'ЮВАО'],
 'Вешняки': [55.721944, 37.799167, 'ВАО'],
 'Ухтомская': [55.698611, 37.864167, 'ЮВАО'],
 'Люберцы I': [55.681667, 37.896944, 'ЮВАО'],
 'Панки': [55.668889, 37.9225, 'ЮВАО'],
 'Томилино': [55.655, 37.954722, 'ЮВАО'],
 'Красково': [55.649722, 37.9825, 'ЮВАО'],
 'Малаховка': [55.645, 38.008333, 'ЮВАО'],
 'Удельная': [55.634444, 38.043889, 'ЮВАО'],
 'Быково': [55.626667, 38.070556, 'ЮВАО'],
 'Ильинская': [55.616389, 38.100278, 'ЮВАО'],
 'Отдых': [55.601111, 38.136944, 'ЮВАО'],
 'Кратово': [55.591667, 38.16, 'ЮВАО'],
 'Есенинская': [55.581944, 38.184167, 'ЮВАО'],
 'Фабричная': [55.572778, 1.873333, 'ЮВАО'],
 'Раменское': [55.565278, 55.565278, 'ЮВАО'],
 'Ипподром': [55.560278, 38.238889, 'ЮВАО'],
 'Железнодорожная': [55.7525, 38.008889, 'ЮВАО'],
 'Ольгино': [55.751667, 37.978611, 'ЮВАО'],
 'Кучино': [55.752222, 37.954722, 'ЮВАО'],
 'Салтыковская': [55.757778, 37.923056, 'ЮВАО'],
 'Никольское': [55.759722, 37.897778, 'ЮВАО'],
 'Реутово': [55.751389, 37.855833, 'ЮВАО'],
 'Кусково': [55.739722, 37.795278, 'ВАО'],
 'Чухлинка': [55.733889, 55.733889, 'ЮВАО'],
 'Серп и Молот': [55.748056, 37.681944, 'ЮВАО'],
 'Ермакова Роща': [55.765556, 37.535278, 'ЮВАО'],
 'Поклонная': [55.728333, 37.511667, 'ЗАО'],
 'Матвеевское': [55.704722, 37.482222, 'ЗАО'],
 'Очаково I': [55.683611, 37.451389, 'ЮВАО'],
 'Мещерская': [55.666667, 37.424444, 'ЗАО'],
 'Солнечная': [55.656944, 37.383611, 'ЗАО'],
 'Переделкино': [55.656111, 37.353889, 'ЗАО'],
 'Мичуринец': [55.646111, 37.315, 'НАО (Новомосковский)'],
 'Внуково': [55.648889, 37.269722, 'НАО (Новомосковский)'],
 'Лесной Городок': [55.630278, 37.219167, 'ЮВАО'],
 'Толстопальцево': [55.607778, 37.186389, 'НАО (Новомосковский)'],
 'Кокошкино': [55.599722, 37.171389, 'НАО (Новомосковский)'],
 'Санино': [55.583889, 37.138333, 'НАО (Новомосковский)'],
 'Крёкшино': [55.577778, 37.109722, 'ТАО (Троицкий)'],
 'Победа': [55.566111, 37.093056, 'ТАО (Троицкий)'],
 'Апрелевка': [55.550278, 37.0675, 'ТАО (Троицкий)']
        }
        // Collect form data
        var formData = new FormData(document.getElementById('houseForm'));
        var jsonData = {};

        
        
        for (var pair of formData.entries()) {
            var floatValue = parseFloat(pair[1]);
            if (!isNaN(floatValue)) {
                // If the value can be parsed as a float, store the float value
                jsonData[pair[0]] = floatValue;
            } else if (pair[1] === '') {
                // If the value is an empty string, store 0
                jsonData[pair[0]] = 0;
            } else {
                // Otherwise, store the original string value
                jsonData[pair[0]] = pair[1];
            }
        }
        var metroStation = jsonData["metro"]; 
        var metroStationCoords = MetroStationsObject[metroStation];
        var longitude = metroStationCoords[0];
        var latitude = metroStationCoords[1];
        var okrug = metroStationCoords[2];

        if (metroStationCoords) {
            var latitude = metroStationCoords[0];
            var longitude = metroStationCoords[1];

            // Add latitude and longitude to JSON data
            jsonData["latitude"] = latitude;
            jsonData["longitude"] = longitude;
            jsonData["okrug"] = okrug;
        } else {
            console.error("Coordinates not found for metro station:", metroStation);
        }
        jsonData["offer_type"] = "flat";
        jsonData["city"] = "Москва";
        jsonData["raion"] = "Нет данных";
        jsonData["street"] = "Нет данных";
        jsonData["house"] = "Нет данных";
        jsonData["id"] = 984231842;
        jsonData["phone"] = "Нет данных";
        jsonData["flat_type"] = "rooms";
        jsonData["is_apartment"] = 0;
        jsonData["is_penthause"] = 0;
        jsonData["living_area"] = 0;
        jsonData["kitchen_area"] = 0;
        jsonData["all_rooms_area"] = 0;
        jsonData["price"] = 0
        jsonData["currency"] = "rur"
        jsonData["house_material_type"] = "Нет данных"
        jsonData["edit_time"] = "2024-04-03 12:55:18.098"
        jsonData["publication_data"] = 1711035688
        jsonData["house_material_bti"] = "Нет данных"
        jsonData["is_emergency"] = 0
        jsonData["house_overlap_type"] = "Нет данных"
        jsonData["metro_time"] = 0
        jsonData["travel_type"] = "Нет данных"
        // Make POST request to your server endpoint
        fetch('http://158.160.159.119:8400/classify_max', {
            method: 'POST',
            body: JSON.stringify(jsonData)
        })
        .then(response => {
            if (!response.ok) {
                throw new Error('Network response was not ok');
            }
            return response.json();
        })
        .then(data => {
            // Display received values on the webpage
            displayReceivedValues(data);
        })
        .catch(error => {
            console.error('There was a problem with your fetch operation:', error);
        });
    });
});

// Function to display received values on the webpage
function displayReceivedValues(data) {
    // Example: Update the content of a div element with the received values
    var resultDiv = document.getElementById('result');
    resultDiv.innerHTML = ''; // Clear previous content
    for (var key in data) {
        var p = document.createElement('p');
        p.textContent = key + ': ' + data[key];
        resultDiv.appendChild(p);
    }
}

